DataProcessors/Лео_СогласованиеКомпенсирующихСкидок/Лео_СогласованиеКомпенсирующихСкидок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Лео_СогласованиеКомпенсирующихСкидок</name>
  <attributes>
    <name>ТекущийПользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольныйОтчет</name>
    <type>
      <types>CatalogRef.ПроизвольныеОтчеты</types>
    </type>
  </attributes>
  <attributes>
    <name>СохраненнаяНастройка</name>
    <type>
      <types>CatalogRef.СохраненныеНастройки</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокументаДляСогласования</name>
    <type>
      <types>EnumRef.абс_ТипыДокументовДляСогласования</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыДляСогласования</name>
    <attributes>
      <name>ДокументДляСогласования</name>
      <type>
        <types>DocumentRef.абс_ВводБюджета</types>
        <types>DocumentRef.абс_СтратегическиеЦелиПродаж</types>
        <types>DocumentRef.ЗаявкаНаРасходованиеСредств</types>
        <types>DocumentRef.ПланПродаж</types>
        <types>DocumentRef.абс_ЗаявкаНаБюджетОтделаТМ</types>
        <types>DocumentRef.Лео_ФиксацияСкидокПоТрейдМаркетингу</types>
      </type>
    </attributes>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>EnumRef.СостоянияОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДокумента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦФО</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекущееСостояние</name>
      <type>
        <types>EnumRef.СостоянияОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоследнийСогласующий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Пометка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.абс_МаршрутыСогласованияДокументов</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

InformationRegisters/абс_СостоянияСогласованияДокументов/абс_СостоянияСогласованияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_СостоянияСогласованияДокументов</name>
  <comment>Состояния согласования документов</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияОбъектов</types>
    </type>
  </resources>
  <resources>
    <name>Уровень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Этап</name>
    <type>
      <types>CatalogRef.абс_МаршрутыСогласованияДокументов</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийЭтап</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументДляСогласования</name>
    <type>
      <types>DocumentRef.Лео_ЗаявкаНаАкцию</types>
      <types>DocumentRef.Лео_ЗаявкаНаОбразцы</types>
      <types>DocumentRef.Лео_ЗаявкаНаЗапчасти</types>
      <types>DocumentRef.СчетФактураПолученный</types>
      <types>DocumentRef.абс_ВводБюджета</types>
      <types>DocumentRef.абс_СтратегическиеЦелиПродаж</types>
      <types>DocumentRef.ЗаявкаНаРасходованиеСредств</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.ПланПродаж</types>
      <types>DocumentRef.абс_ЗаявкаНаБюджетОтделаТМ</types>
      <types>DocumentRef.Лео_ФиксацияСкидокПоТрейдМаркетингу</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Enums/СостоянияОбъектов/СостоянияОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияОбъектов</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>Подготовлен</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
  <enumValues>
    <name>Отложен</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>Отклонен</name>
  </enumValues>
  <enumValues>
    <name>абс_Проведен</name>
    <comment>Оплачен</comment>
  </enumValues>
  <enumValues>
    <name>Лео_ОтправленНаДоработку</name>
  </enumValues>
  <enumValues>
    <name>Лео_КОплате</name>
  </enumValues>
  <enumValues>
    <name>Лео_Завершен</name>
  </enumValues>
  <enumValues>
    <name>Лео_Аннулирован</name>
  </enumValues>
  <enumValues>
    <name>Лео_ПроверенФакт</name>
  </enumValues>
</mdclass:Enum>

Catalogs/абс_МаршрутыСогласованияДокументов/абс_МаршрутыСогласованияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>абс_МаршрутыСогласованияДокументов</name>
  <comment>Маршруты согласования документов</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>СогласованиеДиректором</name>
      <description>Согласование с Генеральным директором </description>
    </items>
    <items>
      <name>СогласованиеПрезидентом</name>
      <description>Согласование с Президентом</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипДокументаДляСогласования</name>
    <type>
      <types>EnumRef.абс_ТипыДокументовДляСогласования</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СогласующиеЛица</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДействия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Лео_ЛицаСДоступомНаРедактирование</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДействия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

DataProcessors/Лео_СогласованиеКомпенсирующихСкидок/ObjectModule.bsl
Функция ОбработатьСогласованиеДокументов() Экспорт
	
	//Получим этапы согласования текущего пользователя
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	МаршрутыСогласованияСогласующиеЛица.Ссылка КАК МаршрутСогласования
	               |ИЗ
	               |	Справочник.абс_МаршрутыСогласованияДокументов.СогласующиеЛица КАК МаршрутыСогласованияСогласующиеЛица
	               |ГДЕ
	               |	МаршрутыСогласованияСогласующиеЛица.Пользователь = &ТекПользователь";
				   
	Запрос.УстановитьПараметр("ТекПользователь", ТекущийПользователь);
	ЭтапыТекущегоПользователя = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("МаршрутСогласования");
	СоответствиеСледующиеЭтапы = Новый Соответствие();
	
	ЕстьОшибки = Ложь;
	
	УспешноОбработанныеДокументы = Новый Массив;
	
	Для Каждого СтрокаТабличнойЧасти ИЗ ДокументыДляСогласования Цикл
		Если НЕ СтрокаТабличнойЧасти.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		//Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.Состояние)
		//	ИЛИ (СтрокаТабличнойЧасти.ПоследнийСогласующий = ТекущийПользователь
		//		И СтрокаТабличнойЧасти.ТекущееСостояние = СтрокаТабличнойЧасти.Состояние) Тогда
		//		
		//	УспешноОбработанныеДокументы.Добавить(СтрокаТабличнойЧасти);
		//	Продолжить;
		//КонецЕсли;

		Отказ = Ложь;
		
		
		//Если статус документа - отклонен, то обязательно должен быть заполнен комментарий
		Если СтрокаТабличнойЧасти.Состояние = Перечисления.СостоянияОбъектов.Отклонен
			И СокрЛП(СтрокаТабличнойЧасти.Комментарий)="" Тогда
				ТекстПоля = ОбщегоНазначенияКлиентСервер.ПолучитьТекстДляВыдачиСообщенийПоСтрокеТЧ("ДокументыДляСогласования", СтрокаТабличнойЧасти.НомерСтроки, "Комментарий");
				ТекстСообщения = НСтр("ru = 'Не указан комментарий для документа &Документ.
											|Состояние документа изменено не будет.'");
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "&Документ", СтрокаТабличнойЧасти.ДокументДляСогласования);
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , ТекстПоля, "Объект", Отказ);
				Продолжить;
		КонецЕсли;
			
				
		//Определим новый этап - это может быть следующий этап (непосредственный родитель) 
		//	или один из вышестоящих этапов
		НовыйЭтап = Неопределено;
		ОпределитьСледующийЭтапСогласования(НовыйЭтап, СтрокаТабличнойЧасти.Этап, ЭтапыТекущегоПользователя, СоответствиеСледующиеЭтапы,СтрокаТабличнойЧасти.ТекущееСостояние);
			
		//Если новый этап не удалось определить - сообщим об ошибке
		//	Такой ситуации возникать не должно.
		Если НовыйЭтап = Неопределено Тогда
			ТекстПоля = ОбщегоНазначенияКлиентСервер.ПолучитьТекстДляВыдачиСообщенийПоСтрокеТЧ("ДокументыДляСогласования", СтрокаТабличнойЧасти.НомерСтроки, "ДокументДляСогласования");
			ТекстСообщения = НСтр("ru = 'Не удалось определить следующий этап согласования документа &Документ.
										|Состояние документа изменено не будет.'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "&Документ", СтрокаТабличнойЧасти.ДокументДляСогласования);
				
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , ТекстПоля,"Объект", Отказ);
			Продолжить;
		КонецЕсли;
		
		Если НЕ НовыйЭтап = Справочники.абс_МаршрутыСогласованияДокументов.ПустаяСсылка()тогда
			НовыйУровень = НовыйЭтап.Уровень() + 1;
		КонецЕсли;	
			
		Если ТипЗнч(СтрокаТабличнойЧасти.ДокументДляСогласования) = Тип("ДокументСсылка.ЗаявкаНаРасходованиеСредств") Тогда
			
			//Обработаем состояние Отказано
			Если СтрокаТабличнойЧасти.Состояние = Перечисления.СостоянияОбъектов.Отклонен
				И СтрокаТабличнойЧасти.ДокументДляСогласования.Проведен Тогда
				
				Попытка
					ДокОбъект = СтрокаТабличнойЧасти.ДокументДляСогласования.ПолучитьОбъект();
					ДокОбъект.Заблокировать();
					ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
				Исключение
					ТекстПоля = ОбщегоНазначенияКлиентСервер.ПолучитьТекстДляВыдачиСообщенийПоСтрокеТЧ("ДокументыДляСогласования", СтрокаТабличнойЧасти.НомерСтроки, "ДокументДляСогласования");
					ТекстСообщения = НСтр("ru = 'Не удалось отменить проведение документа &Документ.
												|Состояние документа изменено не будет.'");
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "&Документ", СтрокаТабличнойЧасти.ДокументДляСогласования);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , ТекстПоля,"Объект", Отказ);
				КонецПопытки;
			КонецЕсли;
			
			// Обработаем изменение состояния с Отказано на другое
			Если СтрокаТабличнойЧасти.ТекущееСостояние = Перечисления.СостоянияОбъектов.Отклонен 
				И НЕ СтрокаТабличнойЧасти.ДокументДляСогласования.Проведен Тогда
				
				Попытка
					ДокОбъект = СтрокаТабличнойЧасти.ДокументДляСогласования.ПолучитьОбъект();
					ДокОбъект.Заблокировать();
					ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
				Исключение
					ТекстПоля = ОбщегоНазначенияКлиентСервер.ПолучитьТекстДляВыдачиСообщенийПоСтрокеТЧ("ДокументыДляСогласования", СтрокаТабличнойЧасти.НомерСтроки, "ДокументДляСогласования");
					ТекстСообщения = НСтр("ru = 'Не удалось провести документ &Документ.
												|Состояние документа изменено не будет'");
												
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "&Документ", СтрокаТабличнойЧасти.ДокументДляСогласования);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , ТекстПоля,"Объект", Отказ);
				КонецПопытки;
			КонецЕсли;
	   		ИначеЕсли ТипЗнч(СтрокаТабличнойЧасти.ДокументДляСогласования) = Тип("ДокументСсылка.Лео_ФиксацияСкидокПоТрейдМаркетингу") Тогда
	        //проставим новое состояние в документе
			
			     Если НовыйЭтап = Справочники.абс_МаршрутыСогласованияДокументов.ПустаяСсылка() И СтрокаТабличнойЧасти.Состояние = Перечисления.СостоянияОбъектов.Согласован Тогда
				
				       НовоеСостояние = Перечисления.СостоянияОбъектов.Утвержден;
					//{Лео Катанович 
				Попытка
					ДокОбъект = СтрокаТабличнойЧасти.ДокументДляСогласования.ПолучитьОбъект();
					ДокОбъект.Заблокировать();
					ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
				Исключение
					Отказ = Истина;
					ТекстПоля = ОбщегоНазначенияКлиентСервер.ПолучитьТекстДляВыдачиСообщенийПоСтрокеТЧ("ДокументыДляСогласования", СтрокаТабличнойЧасти.НомерСтроки, "ДокументДляСогласования");
					ТекстСообщения = НСтр("ru = 'Не удалось провести документ &Документ.
												|Состояние документа изменено не будет'");
												
					ТекстСообщения = СтрЗаменить(ТекстСообщения, "&Документ", СтрокаТабличнойЧасти.ДокументДляСогласования);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , ТекстПоля,"Объект", Отказ);

				КонецПопытки;
				//Лео Катанович}

			     Иначе
				       НовоеСостояние = СтрокаТабличнойЧасти.Состояние;
			     КонецЕсли;

			
			
			
		Иначе
			//проставим новое состояние в документе
			Если СтрокаТабличнойЧасти.Состояние = Перечисления.СостоянияОбъектов.Согласован
				И НовыйУровень = 1 Тогда
				
				НовоеСостояние = Перечисления.СостоянияОбъектов.Утвержден;
			Иначе
				НовоеСостояние = СтрокаТабличнойЧасти.Состояние;
			КонецЕсли;
			
			Попытка
				ДокОбъект = СтрокаТабличнойЧасти.ДокументДляСогласования.ПолучитьОбъект();
				ДокОбъект.Заблокировать();
				ДокОбъект.Состояние=НовоеСостояние;
				Если НовоеСостояние=Перечисления.СостоянияОбъектов.Утвержден Тогда
					ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
				Иначе
					ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
				КонецЕсли;
			Исключение
				ТекстПоля = ОбщегоНазначенияКлиентСервер.ПолучитьТекстДляВыдачиСообщенийПоСтрокеТЧ("ДокументыДляСогласования", СтрокаТабличнойЧасти.НомерСтроки, "ДокументДляСогласования");
				ТекстСообщения = НСтр("ru = 'Не удалось провести документ &Документ.
				|Состояние документа изменено не будет'");
				
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "&Документ", СтрокаТабличнойЧасти.ДокументДляСогласования);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , ТекстПоля,"Объект", Отказ);
			КонецПопытки;
	
		КонецЕсли;
		
		
	//
	//	//Изменим состояние документа в регистре
	//	НаборЗаписейСостояниеСогласования = РегистрыСведений.абс_СостоянияСогласованияДокументов.СоздатьНаборЗаписей();
	//	НаборЗаписейСостояниеСогласования.Отбор.ДокументДляСогласования.Установить(СтрокаТабличнойЧасти.ДокументДляСогласования);
	//	НаборЗаписейСостояниеСогласования.Прочитать();
	//	
	//	//Проверим последнюю запись - если она относится к тому же пользователю и этапу, удалим ее
	//	Если НаборЗаписейСостояниеСогласования.Количество() > 0 Тогда
	//		ПоследняяЗапись = НаборЗаписейСостояниеСогласования[НаборЗаписейСостояниеСогласования.Количество()-1];
	//		Если ПоследняяЗапись.Пользователь = ТекущийПользователь
	//			И ПоследняяЗапись.Этап = НовыйЭтап Тогда
	//			
	//			НаборЗаписейСостояниеСогласования.Удалить(ПоследняяЗапись);
	//		КонецЕсли;
	//	КонецЕсли;

	//	НоваяЗапись = НаборЗаписейСостояниеСогласования.Добавить();
	//	НоваяЗапись.Период = ТекущаяДата();
	//	НоваяЗапись.Активность = Истина;
	//	НоваяЗапись.ДокументДляСогласования= СтрокаТабличнойЧасти.ДокументДляСогласования;
	//	НоваяЗапись.Пользователь = ТекущийПользователь;
	//	НоваяЗапись.Состояние = НовоеСостояние;
	//	НоваяЗапись.Уровень= НовыйУровень;
	//	НоваяЗапись.Этап = НовыйЭтап;
	//	НоваяЗапись.Комментарий = СтрокаТабличнойЧасти.Комментарий;
	//	
	//	НаборЗаписейСостояниеСогласования.Записать();
	//	
	//	УспешноОбработанныеДокументы.Добавить(СтрокаТабличнойЧасти);
	//	
	//КонецЦикла;
	
	//// Удалим из списка документы по которым удалось изменить состояние
	//Для каждого ЭлКоллекции Из УспешноОбработанныеДокументы Цикл
	//	
	//	//Если ЭлКоллекции.ТекущееСостояние = Перечисления.СостоянияОбъектов.Утвержден Тогда
	//		 ДокОбъект = ЭлКоллекции.ДокументДляСогласования.ПолучитьОбъект();
	//		 ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	//	//КонецЕсли;
	//	ДокументыДляСогласования.Удалить(ЭлКоллекции);

	//КонецЦикла; 
	//
	//Возврат НЕ ЕстьОшибки;
	
	
	Если Отказ Тогда
			ЕстьОшибки = Истина;
			Продолжить;
		КонецЕсли;
	
		//Изменим состояние документа в регистре
		НаборЗаписейСостояниеСогласования = РегистрыСведений.абс_СостоянияСогласованияДокументов.СоздатьНаборЗаписей();
		НаборЗаписейСостояниеСогласования.Отбор.ДокументДляСогласования.Установить(СтрокаТабличнойЧасти.ДокументДляСогласования);
		НаборЗаписейСостояниеСогласования.Прочитать();
		
		//Проверим последнюю запись - если она относится к тому же пользователю и этапу, удалим ее
		Если НаборЗаписейСостояниеСогласования.Количество() > 0 Тогда
			ПоследняяЗапись = НаборЗаписейСостояниеСогласования[НаборЗаписейСостояниеСогласования.Количество()-1];
			Если ПоследняяЗапись.Пользователь = ТекущийПользователь
				И ПоследняяЗапись.Этап = НовыйЭтап Тогда
				
				НаборЗаписейСостояниеСогласования.Удалить(ПоследняяЗапись);
			КонецЕсли;
		КонецЕсли;

		НоваяЗапись = НаборЗаписейСостояниеСогласования.Добавить();
		НоваяЗапись.Период = ТекущаяДата();
		НоваяЗапись.Активность = Истина;
		НоваяЗапись.ДокументДляСогласования= СтрокаТабличнойЧасти.ДокументДляСогласования;
		НоваяЗапись.Пользователь = ТекущийПользователь;
		НоваяЗапись.Состояние = НовоеСостояние;
		НоваяЗапись.Уровень= НовыйУровень;
		НоваяЗапись.Этап = НовыйЭтап;
		НоваяЗапись.Комментарий = СтрокаТабличнойЧасти.Комментарий;
		НоваяЗапись.ТекущийЭтап = СтрокаТабличнойЧасти.Этап;
 		НаборЗаписейСостояниеСогласования.Записать();
		
		УспешноОбработанныеДокументы.Добавить(СтрокаТабличнойЧасти);
		
		// {Лео Катанович
		
					ОбработкаСогласования = Обработки.абс_СогласованиеДокументов.Создать();
					ОбработкаСогласования.СформироватьЗадачуСотруднику(НоваяЗапись.ДокументДляСогласования, НовыйЭтап,НовоеСостояние);
		// Лео Катанович}
		
	КонецЦикла;
	
	// Удалим из списка документы по которым удалось изменить состояние
	Для каждого ЭлКоллекции Из УспешноОбработанныеДокументы Цикл
		ДокументыДляСогласования.Удалить(ЭлКоллекции);
	КонецЦикла; 
	
	Возврат НЕ ЕстьОшибки;

КонецФункции

//Процедура определяет этап согласования, который соответствует маршруту согласования и текущему пользователю
Процедура ОпределитьСледующийЭтапСогласования(НовыйЭтап, ТекущийЭтап, ЭтапыТекущегоПользователя, СоответствиеСледующиеЭтапы,ТекущееСостояние)
	
	НовыйЭтап = ТекущийЭтап.Родитель;
	
	//НовыйЭтап = СоответствиеСледующиеЭтапы.Получить(ТекущийЭтап);
	//
	//Если НовыйЭтап = Неопределено Тогда
	//	Если ЭтапыТекущегоПользователя.Найти(ТекущийЭтап)<>Неопределено И НЕ ТекущееСостояние =  Перечисления.СостоянияОбъектов.Согласован Тогда
	//		НовыйЭтап = ТекущийЭтап;
	//		СоответствиеСледующиеЭтапы.Вставить(ТекущийЭтап, НовыйЭтап);
	//	ИначеЕсли ЗначениеЗаполнено(ТекущийЭтап.Родитель) Тогда
	//		ОпределитьСледующийЭтапСогласования(НовыйЭтап, ТекущийЭтап.Родитель, ЭтапыТекущегоПользователя, СоответствиеСледующиеЭтапы,Перечисления.СостоянияОбъектов.ПустаяСсылка())
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры

//Процедура СформироватьЗадачуСотруднику(ДокументСсылка, НовыйЭтап,НовоеСостояние) Экспорт
//	
//	   
//	   Если НовыйЭтап = Справочники.абс_МаршрутыСогласованияДокументов.ПустаяСсылка() Тогда
//		   Если НовоеСостояние =  Перечисления.СостоянияОбъектов.Утвержден Тогда
//			   Если ДокументСсылка.ВидКомпенсации = "Автоматическая скидка" Тогда // Только для автоматической скидки
//					НовыйЭтап = Справочники.абс_МаршрутыСогласованияДокументов.НайтиПоНаименованию("Установить компенсирующие скидки"); 
//					Для Каждого СтрокаИсполнителя из НовыйЭтап.СогласующиеЛица Цикл
//						 НоваяЗадача = Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
//						 НоваяЗадача.Дата			= ТекущаяДата();
//						 НоваяЗадача.ВидЗадачи    = Справочники.ВидыЗадачПользователей.Исполнение;
//						 НоваяЗадача.ОбъектЗадачи	= ДокументСсылка;
//						 НоваяЗадача.Наименование	= "Отразить в учете скидки по документу:" + Строка(ТипЗнч(ДокументСсылка)) + " " + ДокументСсылка.Контрагент.Наименование;
//						 НоваяЗадача.Исполнитель  = СтрокаИсполнителя.Пользователь;
//						 НоваяЗадача.Уровень      = НовыйЭтап.Уровень();
//						 НоваяЗадача.Записать();
//					 КонецЦикла;	
//			   КонецЕсли;	 				     
//			ИначеЕсли НовоеСостояние =  Перечисления.СостоянияОбъектов.Отклонен Тогда
//				НоваяЗадача = Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
//				НоваяЗадача.Дата			= ТекущаяДата();
//				НоваяЗадача.ВидЗадачи	    = Справочники.ВидыЗадачПользователей.Согласование;
//				НоваяЗадача.ОбъектЗадачи	= ДокументСсылка;
//				НоваяЗадача.Наименование	= "Ознакомиться с результатом согласования документа: " + Строка(ТипЗнч(ДокументСсылка)) + " " + ДокументСсылка.Контрагент.Наименование + " (" + НовыйЭтап.Наименование + ")";
//				НоваяЗадача.Исполнитель	    = ДокументСсылка.Ответственный;
//				//НоваяЗадача.Уровень         = НовыйЭтап.Уровень();
//				НоваяЗадача.Записать();
//		   КонецЕсли;    				  
//		   Возврат;	 
//	   КонецЕсли;	 
//	   
//	   
//		Для Каждого СтрокаИсполнителя из НовыйЭтап.СогласующиеЛица Цикл
//				НоваяЗадача = Задачи.ЗадачаИсполнителя.СоздатьЗадачу();
//				НоваяЗадача.Дата			= ТекущаяДата();
//				НоваяЗадача.ВидЗадачи	    = Справочники.ВидыЗадачПользователей.Согласование;
//				НоваяЗадача.ОбъектЗадачи	= ДокументСсылка;
//				НоваяЗадача.Наименование	= "Согласовать документ " + Строка(ТипЗнч(ДокументСсылка)) + " " + ДокументСсылка.Контрагент.Наименование + " (" + НовыйЭтап.Наименование + ")";
//				НоваяЗадача.Исполнитель	    = СтрокаИсполнителя.Пользователь;
//				НоваяЗадача.Уровень         = НовыйЭтап.Уровень();
//				НоваяЗадача.Записать();
//				
//	   КонецЦикла;	

//КонецПроцедуры
////Лео Катанович}
